prof_repo/ProfilPortant/TD2_NACA_Profil/pimpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         0.5;

deltaT          1e-5;

adjustTimeStep  yes;
maxCo           0.9;
maxDeltaT       1e-3;

writeControl    adjustableRunTime;
writeInterval   0.1;

purgeWrite      10;

writeFormat     ascii;
writePrecision  8;

runTimeModifiable yes;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (wing);
        rhoInf          1.225;
        rho             rhoInf;
        CofR            (0 0 0);
        writeControl    timeStep;
        writeInterval   5;
    }

    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        patches         (wing);
        rhoInf          1.225;
        rho             rhoInf;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         100;
        lRef            1.0;
        Aref            0.25;
        writeControl    timeStep;
        writeInterval   5;
    }
}

// ************************************************************************* //
