prof_repo/ProfilPortant/TD2_NACA_Profil/pimpleFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (100 0 0);

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform (100 0 0);
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform (0 0 0);
        value       uniform (100 0 0);
    }

    wing
    {
        type        noSlip;
    }

    top
    {
        type        slip;
    }

    bottom
    {
        type        slip;
    }

    symFront
    {
        type        empty;
    }

    symBack
    {
        type        empty;
    }
}

// ************************************************************************* //
