prof_repo/ProfilPortant/TD2_NACA_Profil/pimpleFoam/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 32;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 32;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform 32;
        value       uniform 32;
    }

    wing
    {
        type        omegaWallFunction;
        value       uniform 32;
    }

    top
    {
        type        slip;
    }

    bottom
    {
        type        slip;
    }

    symFront
    {
        type        empty;
    }

    symBack
    {
        type        empty;
    }
}

// ************************************************************************* //
